var jobs = [
  ['도둑', '수호자'],
  ['카사노바', '소리없는방귀빌런', '절대강자', '촉법소년', '노숙자']
]

var locations = [
  ['노인정', '사우나', '성인용품점', '러브호텔', '피시방', '국어학원', '수학학원', '영어학원', '과학학원', '기숙학원', '기숙사', '독서실', '마트', '스터디카페', '노약자석', '임산부석', '장애인석', '대형마트시식대', '경찰서', '대중목욕탕', '무료급식소', '초등학교', '중학교', '고등학교', '편의점'],
  ['어린이보호구역', '장례식장', '수능갤러리', '공사장']
]

var specificLocations = {
  '어린이보호구역': '스피드레이서',
  '장례식장' : '육계장미식가',
  '수능갤러리' : '삼수생',
  '공사장' : '안전모'
}

var objects = [
  '수건', '때밀이수건', '흑돌', '백돌', '러브젤', '노트', '교재', '연필심', '샤프심', '충전기', '마우스', '지우개', '테이저건', '콘돔', '분필', '젓가락'
]

var exampleNames = [
  '엄준식', '고강건', '박종현', '유현재', '안주현', '이건우', '김민식', '엄종현', '방인', '이용호', '김길수', '정성섭', '정지웅', '이진규'
]

var exampleLocations = [
  '동탄', '서울', '부산', '인천', '대구', '대전', '광주', '울산', '제주', '수원', '고양', '용인', '창원', '성남', '청주', '부천', '화성', '남양주', '전주', '천안', '안산', '안양'
]